app/views/aorders/_form.html.erb

SELECT `departments`.* FROM `departments`
---
      <td>
        <%= f.collection_select(:department_id, Department.all, :id, :name)  %>

SELECT `aautos`.* FROM `aautos`
---
        <% if is_admin? %>
          <%= f.collection_select(:aauto_id, Aauto.all, :id, :name_autodesc, :prompt => 'Не назначен')  %>

SELECT `users`.* FROM `users`
---
        <td>
          <%= f.collection_select(:user_id, User.all, :id, :name, :prompt => 'Не назначен')  %>