app/views/aorders/_onlineautos.erb

SELECT `aautos`.* FROM `aautos`
---
          <%= f.hidden_field :odate_id %>
          <%= f.collection_select(:aauto_id, Aauto.all, :id, :name_autodesc, :prompt => 'Не назначен', :size=>'5')  %>