app/controllers/aautos_controller.rb

  def index
    @aautos = Aauto.all
---
SELECT `aautos`.* FROM `aautos`

  def show
    @aauto = Aauto.find(params[:id])
---
SELECT `aautos`.* FROM `aautos` WHERE `aautos`.`id` = 5 LIMIT 1

  def edit
    @aauto = Aauto.find(params[:id])
---
SELECT `aautos`.* FROM `aautos` WHERE `aautos`.`id` = 4 LIMIT 1

  def create
    @aauto = Aauto.new(params[:aauto])

    respond_to do |format|
      if @aauto.save
---
INSERT INTO `aautos` (`autodesc`, `autonumber`, `contact`, `created_at`, `name`, `updated_at`) VALUES ('avto1', 'nomer1', 'telefon1', '2015-02-04 23:12:31', 'vod1', '2015-02-04 23:12:31')

  def update
    @aauto = Aauto.find(params[:id])

    respond_to do |format|
      if @aauto.update_attributes(params[:aauto])
---
SELECT `aautos`.* FROM `aautos` WHERE `aautos`.`id` = 8 LIMIT 1
UPDATE `aautos` SET `name` = 'Шкода Октавия (УНГ)', `autodesc` = 'нет', `autonumber` = 'ХЗ32323ХЗ', `contact` = '050-87544154', `updated_at` = '2015-02-18 19:53:27' WHERE `aautos`.`id` = 8