app/controllers/actions_controller.rb

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `companies`.* FROM `companies`
SELECT `users`.* FROM `users` WHERE `users`.`company_id` = 1
---
  def tabel

    params[:company_id] && @company=Company.find_by_id(params[:company_id])
    @company||=session[:user].company

    if is_admin?
      @company ? @users=@company.users.all : @users=User.all