app/controllers/aorders_controller.rb

  def uporderstable
    if session[:user]

      last_today_act = session[:user].actions.where("created_at>'#{DateTime.current.beginning_of_day.to_s(:db)}' and created_at<'#{DateTime.current.end_of_day.to_s(:db)}'").last

      last_today_act.update_attributes!(
        :kind=>"stay_in",
        :updated_at => DateTime.current
      )

      @odate = session[:working_date]
      @aorders = Aorder.joins("LEFT OUTER JOIN `aautos` ON `aautos`.`id` = `aorders`.`aauto_id`").order(session[:sort_orders_by]).where("odate_id=#{@odate.id} AND iscanceled=false")
      @aorder = Aorder.new
      @aorder.odate=@odate
      @aorder.iscanceled=false
      @aorder.outofcity=0
      @aorder.user_id=session[:user].id if session[:user]
      @aorder.ftime=Time.now.localtime
      @aorder.totime=Time.now.localtime

      @onlineautos=Onlineauto.find_all_by_odate_id(@odate.id)
---
SELECT `actions`.* FROM `actions` WHERE `actions`.`user_id` = 1 AND (created_at>'2015-02-04 00:00:00' and created_at<'2015-02-04 23:59:59') ORDER BY `actions`.`id` DESC LIMIT 1
UPDATE `actions` SET `updated_at` = '2015-02-04 22:53:04' WHERE `actions`.`id` = 2
SELECT `aorders`.* FROM `aorders` LEFT OUTER JOIN `aautos` ON `aautos`.`id` = `aorders`.`aauto_id` WHERE (odate_id=2 AND iscanceled=false)
SELECT `onlineautos`.* FROM `onlineautos` WHERE `onlineautos`.`odate_id` = 2

  def setdate
    if not session[:working_date]=Odate.find_by_thedate(params[:tek_date])
      d=Odate.new
      d.isclosed=false
      d.thedate=params[:tek_date]
      d.save
---
SELECT `odates`.* FROM `odates` WHERE `odates`.`thedate` = '2015-02-06' LIMIT 1
INSERT INTO `odates` (`created_at`, `isclosed`, `thedate`, `updated_at`) VALUES ('2015-02-07 23:17:44', 0, '2015-02-05', '2015-02-07 23:17:44')

  def index

    flash.keep

    @odate = session[:working_date]
    session[:sort_orders_by]||='id'
    @aorders = Aorder.joins("LEFT OUTER JOIN `aautos` ON `aautos`.`id` = `aorders`.`aauto_id`").order(session[:sort_orders_by]).where("odate_id=#{@odate.id} AND iscanceled=false")
    @aorder = Aorder.new
    @aorder.odate=@odate
    @aorder.iscanceled=false
    @aorder.user_id=session[:user].id
    @aorder.ftime=Time.now.localtime
    @aorder.totime=Time.now.localtime

    @onlineautos=Onlineauto.find_all_by_odate_id(@odate.id)
---
SELECT `aorders`.* FROM `aorders` LEFT OUTER JOIN `aautos` ON `aautos`.`id` = `aorders`.`aauto_id` WHERE (odate_id=2 AND iscanceled=false) ORDER BY id
SELECT `onlineautos`.* FROM `onlineautos` WHERE `onlineautos`.`odate_id` = 2

  def show
    @aorder = Aorder.find(params[:id])
---
SELECT `aorders`.* FROM `aorders` WHERE `aorders`.`id` = 11 LIMIT 1

  def edit

    @odate = session[:working_date]
    @onlineautos=Onlineauto.find_all_by_odate_id(@odate.id)

    @aorder = Aorder.find(params[:id])
---
SELECT `onlineautos`.* FROM `onlineautos` WHERE `onlineautos`.`odate_id` = 5
SELECT `aorders`.* FROM `aorders` WHERE `aorders`.`id` = 2 LIMIT 1

  def create
    @odate = session[:working_date]
    @aorder = Aorder.new(params[:aorder])
    @aorder.ttmid=session[:user].id
    respond_to do |format|
      if @aorder.save
---
INSERT INTO `aorders` (`aauto_id`, `adestination`, `comment`, `contact`, `created_at`, `ftime`, `iscanceled`, `odate_id`, `odobegin`, `odoend`, `ondepartment`, `onname`, `outofcity`, `totime`, `updated_at`, `user_id`) VALUES (NULL, 'werwer', 'werwr', 'werwr', '2015-02-18 17:21:56', '2015-02-18 17:00:00', 0, 1, 100, 120, 'werwer', 'werewr', 0, '2015-02-18 17:00:00', '2015-02-18 17:21:56', 1)

  def update
    @odate = session[:working_date]
    @aorder = Aorder.find(params[:id])
    @aorder.ttmid=session[:user].id

    @onlineautos=Onlineauto.find_all_by_odate_id(@odate.id)

    respond_to do |format|
      if @aorder.update_attributes(params[:aorder])
---
SELECT `aorders`.* FROM `aorders` WHERE `aorders`.`id` = 2 LIMIT 1
SELECT `onlineautos`.* FROM `onlineautos` WHERE `onlineautos`.`odate_id` = 5
UPDATE `aorders` SET `adestination` = 'куда1 ьеуцп івапдолвжіпрів івапвіапр іварппаві', `updated_at` = '2015-02-14 22:38:08' WHERE `aorders`.`id` = 1