app/controllers/companies_controller.rb

SELECT `companies`.* FROM `companies`
---
  def index
    @companies = Company.all

SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
---
  def show
    @company = Company.find(params[:id])

INSERT INTO `companies` (`created_at`, `istabelling`, `name`, `updated_at`) VALUES ('2015-02-04 22:51:00', 1, 'Компания1', '2015-02-04 22:51:00')
---
  def create
    @company = Company.new(params[:company])

    respond_to do |format|
      if @company.save