app/controllers/onlineautos_controller.rb

INSERT INTO `onlineautos` (`aauto_id`, `created_at`, `odate_id`, `onduty`, `updated_at`) VALUES (5, '2015-02-04 23:13:37', 2, NULL, '2015-02-04 23:13:37')
---
  def create
    @onlineauto=Onlineauto.new(params[:onlineauto])
    @onlineauto.save!

SELECT `onlineautos`.* FROM `onlineautos` WHERE `onlineautos`.`id` = 2 LIMIT 1
DELETE FROM `onlineautos` WHERE `onlineautos`.`id` = 2
---
  def destroy
    @onlineauto = Onlineauto.find(params[:id])
    @onlineauto.destroy

SELECT `onlineautos`.* FROM `onlineautos` WHERE `onlineautos`.`odate_id` = 4 LIMIT 1
SELECT `odates`.* FROM `odates` WHERE (thedate < '2015-02-07') ORDER BY thedate
INSERT INTO `onlineautos` (`aauto_id`, `created_at`, `odate_id`, `onduty`, `updated_at`) VALUES (5, '2015-02-07 23:12:33', 4, NULL, '2015-02-07 23:12:33')
---
  def fillautos
    if  not Onlineauto.find_by_odate_id(session[:working_date])
      lastdate=Odate.find(:all, :order =>'thedate', :conditions => "thedate < '#{session[:working_date].thedate}'").last
      oldautos=Onlineauto.find_all_by_odate_id(lastdate.id) if lastdate

      oldautos.each do |od|
        newauto=Onlineauto.new
        newauto.aauto_id=od.aauto_id
        newauto.odate_id=session[:working_date].id
        newauto.save