app/controllers/sessions_controller.rb

  def create
     user = User.authenticate(params[:name], params[:password])
     if user
       session[:user] = user
       user.actions.create( :kind => "login" )
---
INSERT INTO `actions` (`created_at`, `kind`, `updated_at`, `user_id`) VALUES ('2015-02-04 22:52:20', 'login', '2015-02-04 22:52:20', 1)