app/controllers/stat_controller.rb

SELECT `aautos`.* FROM `aautos` WHERE `aautos`.`id` IN (5, 6, 5, 6, 6, 5, 5)
---
	def routelist
#	@aorders = Aorder.get_by_dates(params[:first_date], params[:last_date]).where("aorders.aauto_id= ? ", params[:auto_id])
#	@odates = Odate.used_in_orders(@aorders).order(:thedate)

# получаем массив  интересующих нас aorders по датам и машине
		aorders = Aorder.get_by_dates( params[:first_date], params[:last_date] ).where("aorders.aauto_id IN (?) ", params[:auto_id]).reorder(:thedate)

# получаем idшки дней где оно біло
		used_odate_ids = aorders.pluck(:odate_id).uniq

#формируем хеш {дата  => [масив ордеров] }
		@days_of_orders={}

		used_odate_ids.each do |curr_odate_id|
			@days_of_orders[ Odate.find_by_id(curr_odate_id) ] = aorders.where("odate_id = ?", curr_odate_id).order(:ftime)
		end


		# @auto = Aauto.find_all_by(id: params[:auto_id])
		@auto = Aauto.find(params[:auto_id])