app/controllers/users_controller.rb

INSERT INTO `users` (`company_id`, `created_at`, `email`, `name`, `password_hash`, `password_salt`, `updated_at`, `userlevel_id`) VALUES (1, '2015-02-04 22:51:56', 'siafin2010@gmail.com', 'admin', '$2a$10$oApGaYVkvc/uA3LOiiZn3OipieWepduZZ/HqtPsdyG/GtqS8tu1eW', '$2a$10$oApGaYVkvc/uA3LOiiZn3O', '2015-02-04 22:51:56', 2)
---
  def create
    @user = User.new(params[:user])
    get_companies_and_userlevels

    if @user.save

SELECT `users`.* FROM `users`
---
  def index
    if is_admin?
      @users=User.all